tmp/useraccessinfomedia/tags/0.1/.svn/text-base/infomedia.wsdl.svn-base

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
xmlns:uaim="http://oss.dbc.dk/ns/useraccessinfomedia" 
targetNamespace="http://oss.dbc.dk/ns/useraccessinfomedia" xmlns:xs="http://www.w3.org/2001/XMLSchema" 
xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
	<wsdl:types>
		<xs:schema elementFormDefault="qualified">
		<xs:import schemaLocation="infomedia.xsd" namespace="http://oss.dbc.dk/ns/useraccessinfomedia"/>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="checkArticleRequest">
		<wsdl:part name="body" element="uaim:checkArticleRequest"/>
	</wsdl:message>
	<wsdl:message name="checkArticleResponse">
		<wsdl:part name="body" element="uaim:checkArticleResponse"/>
	</wsdl:message>
		<wsdl:message name="checkReviewRequest">
		<wsdl:part name="body" element="uaim:checkReviewRequest"/>
	</wsdl:message>
	<wsdl:message name="checkReviewResponse">
		<wsdl:part name="body" element="uaim:checkReviewResponse"/>
	</wsdl:message>
	<wsdl:message name="getArticleRequest">
		<wsdl:part name="body" element="uaim:getArticleRequest"/>
	</wsdl:message>
	<wsdl:message name="getArticleResponse">
		<wsdl:part name="body" element="uaim:getArticleResponse"/>
	</wsdl:message>
		<wsdl:message name="getReviewRequest">
		<wsdl:part name="body" element="uaim:getReviewRequest"/>
	</wsdl:message>
	<wsdl:message name="getReviewResponse">
		<wsdl:part name="body" element="uaim:getReviewResponse"/>
	</wsdl:message>
	<wsdl:portType name="userAccessInfomediaPortType">
		<wsdl:operation name="checkArticle">
			<wsdl:input message="uaim:checkArticleRequest"/>
			<wsdl:output message="uaim:checkArticleResponse"/>
		</wsdl:operation>
		<wsdl:operation name="checkReview">
			<wsdl:input message="uaim:checkReviewRequest"/>
			<wsdl:output message="uaim:checkReviewResponse"/>
		</wsdl:operation>
				<wsdl:operation name="getArticle">
			<wsdl:input message="uaim:getArticleRequest"/>
			<wsdl:output message="uaim:getArticleResponse"/>
		</wsdl:operation>
		<wsdl:operation name="getReview">
			<wsdl:input message="uaim:getReviewRequest"/>
			<wsdl:output message="uaim:getReviewResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="userAccessInfomediaSoapBinding" type="uaim:userAccessInfomediaPortType">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="checkArticle">
			<soap:operation soapAction="http://didicas.dbc.dk/useraccessinfomedia"/>
			<wsdl:input name="checkArticleRequest">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="checkArticleResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="checkReview">
			<soap:operation soapAction="http://didicas.dbc.dk/useraccessinfomedia"/>
			<wsdl:input name="checkReviewRequest">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="checkReviewResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="getArticle">
			<soap:operation soapAction="http://didicas.dbc.dk/useraccessinfomedia"/>
			<wsdl:input name="getArticleRequest">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="getArticleResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="getReview">
			<soap:operation soapAction="http://didicas.dbc.dk/useraccessinfomedia"/>
			<wsdl:input name="getReviewRequest">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="getReviewResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<!--<wsdl:service name="userAccessInfomediaService">-->
<wsdl:service name="infomediaWS">
		<wsdl:port name="userAccessInfomediaPortType" 
binding="uaim:userAccessInfomediaSoapBinding">
			<soap:address location="http://didicas.dbc.dk/useraccessinfomedia/"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
