tmp/useraccessinfomedia/branches/testing/xml/request/.svn/text-base/getReview.xml.svn-base

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope"
 xmlns:xml="http://www.w3.org/XML/1998/namespace"
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
 xmlns:xs="http://www.w3.org/2001/XMLSchema"
 xmlns:uaim="http://oss.dbc.dk/ns/useraccessinfomedia"
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
 xmlns:xmlns="http://www.w3.org/1999/xhtml">
<SOAP-ENV:Body>
<uaim:getReviewRequest>
  <uaim:workIdentifier>
    <uaim:isbn>?</uaim:isbn>
    <uaim:faust>?</uaim:faust>
  </uaim:workIdentifier>
  <uaim:libraryCode>?</uaim:libraryCode>
  <uaim:userId>?</uaim:userId>
  <uaim:userPinCode>?</uaim:userPinCode>
  <uaim:callback>?</uaim:callback>
  <uaim:outputType>?</uaim:outputType>
  <uaim:operation>?</uaim:operation>
</uaim:getReviewRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
