tmp/useraccessinfomedia/tags/1.2/xml/request/getArticle.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope"
 xmlns:xml="http://www.w3.org/XML/1998/namespace" 
 xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
 xmlns:xs="http://www.w3.org/2001/XMLSchema" 
 xmlns:uaim="http://oss.dbc.dk/ns/useraccessinfomedia" 
 xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
 xmlns:xmlns="http://www.w3.org/1999/xhtml">
<SOAP-ENV:Body>
<uaim:getArticleRequest>
    <uaim:articleIdentifier>
      <uaim:faust>27882501</uaim:faust>
    </uaim:articleIdentifier>
    <uaim:libraryCode>718300</uaim:libraryCode>
    <uaim:userId>0019</uaim:userId>
    <uaim:userPinCode>0019</uaim:userPinCode>
    <uaim:outputType>xml</uaim:outputType>
</uaim:getArticleRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

